In [25]:
import pandas as pd
import numpy as np

In [2]:
data=pd.read_csv("ads.csv")

In [3]:
data.head()

    User ID  Age  EstimatedSalary  Purchased
0  15624510   19            19000          0
1  15810944   35            20000          0
2  15668575   26            43000          0
3  15603246   27            57000          0
4  15804002   19            76000          0

In [36]:
data['new_col']=0      #Set the entire column as 0

In [37]:
data=data.drop('new_col',axis=1)   #Column wise drop axis=1

In [17]:
min(data['Age'])

18

### Binning

In [38]:
# Categorise based on continuous distribution
data['age_cat']=pd.cut(data['Age'],bins=[17,30,45,60],labels=['Youth','Mid-Age','Adult'])   
#Lower Limit Excluded so to include 18 we add 17
#UpperLimit Inclusive.

###### Label Encoding

In [19]:
data['age_cat'].cat.codes   # Do the Label Encoding ..

0      0
1      1
2      0
3      0
4      0
      ..
395    2
396    2
397    2
398    1
399    2
Length: 400, dtype: int8

##### One Hot Encoding

In [40]:
#Encoding -> Label Encoding (used in a hierarchical column,preserve hierarchy)
#-> One hot encoding 
# convert youth=0,mid=1,adult=2
# One Hot Encoding(No Hierarchy in a column[generic columns] produce n columns based on the distinct values in a column )
# multi colinerarity -Features dependent on each other should not exist 
df=pd.get_dummies(data['age_cat'])

###### Remove Multi-colinearity

In [39]:
# One hot encoding   drop_first removes multi colinerarity
df=pd.get_dummies(data['age_cat'],drop_first=True)

In [24]:
#Concatenate Multiple columns in the Existing Data frame
data_new=pd.concat([data,df],axis=1)

### Pivot Table

In [33]:
pd.pivot_table(data_new,columns='age_cat',values='EstimatedSalary',aggfunc=np.median,index='Purchased') #index adds another column and compute median sal from those who purchased / not   #can also be done using groupby

age_cat     Youth  Mid-Age  Adult
Purchased
0           59000    61000  74000
1          129000   112000  73000

In [35]:
pd.pivot_table(data_new,columns=['age_cat','Purchased'],values='EstimatedSalary',aggfunc=np.median)

age_cat          Youth         Mid-Age          Adult
Purchased            0       1       0       1      0      1
EstimatedSalary  59000  129000   61000  112000  74000  73000